/*Лабораторнаная работа №1 Графики*/

#include <iostream>
#include <cmath>

using namespace std;
int main()
{
   float x, y; // объявляем пременные

   cout << "x = ";
   cin >> x;

   if (-6 >= x && x >= -7)
   { // отрезок от -7 до -6

      // y=1;
      cout << "y = 1"; // расчет у для заданного отрезка
   }
   else if (x <= -4)
   { // отрезок от -6 до -4
      y = -0.5 * x - 2;
      cout << "y = "<< y; // расчет у для заданного отрезка
   }
   else if (x <= 0)
   {                                   // отрезок от -4 до 0
      y = sqrt(4 - pow((x+2) , 2)); // расчет у для заданного отрезка
      cout << "y = "<< y;
   }
   else if (x <= 2)
   {                                // отрезок от 0 до 2
      y = -sqrt((1) - pow((x-1), 2)); // расчет у для заданного отрезка
      cout << "y = "<< y;
   }
   else if (x <= 3)
   {              // отрезок от 2 до 3
      y = -x + 2; // расчет у для заданного отрезка
      cout << "y = "<< y;
   }
   else
   {
      cout << "g";
   }
}
